Revit 2027 API
GroupSet.Contains Method
Tests for the existence of a group within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Group item
)
Public Overridable Function Contains (
	item As Group
) As Boolean
public:
virtual bool Contains(
	Group^ item
)
abstract Contains :
        item : Group -> bool
override Contains :
        item : Group -> bool
Parameters
item Group
The group to be searched for.
Return Value
Boolean
The Contains method returns True if the group is within the set, otherwise False.
See Also
Reference
GroupSet Class
Autodesk.Revit.DB Namespace